ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M480/device/StdDriver/m480_can.c
        tCAN->IF[u32MsgIfNum].DAT_A1  = 0ul;
        tCAN->IF[u32MsgIfNum].DAT_A2  = 0ul;
        tCAN->IF[u32MsgIfNum].DAT_B1  = 0ul;
        tCAN->IF[u32MsgIfNum].DAT_B2  = 0ul;

        tCAN->IF[u32MsgIfNum].CREQ = 1ul + u8MsgObj;
        ReleaseIF(tCAN, u32MsgIfNum);
    }

    return rev;
}

/**
  * @brief Gets the message
  * @param[in] u8MsgObj Specifies the Message object number, from 0 to 31.
  * @param[in] u8Release Specifies the message release indicator.
  *                      This parameter can be one of the following values:
  *                      TRUE: the message object is released when getting the data.
  *                      FALSE:the message object is not released.
  * @param[in] pCanMsg Pointer to the message structure where received data is copied.
  * @retval TRUE Success
  * @retval FALSE No any message received
  * @details Gets the message, if received.
  */
int32_t CAN_ReadMsgObj(CAN_T *tCAN, uint8_t u8MsgObj, uint8_t u8Release, STR_CANMSG_T *pCanMsg)
{
    int32_t rev = 1l;
    uint32_t u32MsgIfNum;

    if (!CAN_IsNewDataReceived(tCAN, u8MsgObj)) {
        rev = 0; /* return FALSE */
    } else {
        /* Get and lock a free interface */
        if ((u32MsgIfNum = LockIF_TL(tCAN)) == 2ul) {
            rev = 0; /* return FALSE */
        } else {
            tCAN->STATUS &= (~CAN_STATUS_RXOK_Msk);

            /* read the message contents*/
            tCAN->IF[u32MsgIfNum].CMASK = CAN_IF_CMASK_MASK_Msk
                                          | CAN_IF_CMASK_ARB_Msk
                                          | CAN_IF_CMASK_CONTROL_Msk
                                          | CAN_IF_CMASK_CLRINTPND_Msk
                                          | (u8Release ? CAN_IF_CMASK_TXRQSTNEWDAT_Msk : 0ul)
                                          | CAN_IF_CMASK_DATAA_Msk
                                          | CAN_IF_CMASK_DATAB_Msk;

            tCAN->IF[u32MsgIfNum].CREQ = 1ul + u8MsgObj;

            while (tCAN->IF[u32MsgIfNum].CREQ & CAN_IF_CREQ_BUSY_Msk) {
                /*Wait*/
            }

            if ((tCAN->IF[u32MsgIfNum].ARB2 & CAN_IF_ARB2_XTD_Msk) == 0ul) {
                /* standard ID*/
                pCanMsg->IdType = CAN_STD_ID;
                pCanMsg->Id     = (tCAN->IF[u32MsgIfNum].ARB2 & CAN_IF_ARB2_ID_Msk) >> 2ul;
            } else {
                /* extended ID*/
                pCanMsg->IdType = CAN_EXT_ID;
                pCanMsg->Id  = (((tCAN->IF[u32MsgIfNum].ARB2) & 0x1FFFul) << 16) | tCAN->IF[u32MsgIfNum].ARB1;
            }

            pCanMsg->DLC     = (uint8_t)(tCAN->IF[u32MsgIfNum].MCON & CAN_IF_MCON_DLC_Msk);
            pCanMsg->Data[0] = (uint8_t)(tCAN->IF[u32MsgIfNum].DAT_A1 & CAN_IF_DAT_A1_DATA0_Msk);
            pCanMsg->Data[1] = (uint8_t)((tCAN->IF[u32MsgIfNum].DAT_A1 & CAN_IF_DAT_A1_DATA1_Msk) >> CAN_IF_DAT_A1_DATA1_Pos);
            pCanMsg->Data[2] = (uint8_t)(tCAN->IF[u32MsgIfNum].DAT_A2 & CAN_IF_DAT_A2_DATA2_Msk);
            pCanMsg->Data[3] = (uint8_t)((tCAN->IF[u32MsgIfNum].DAT_A2 & CAN_IF_DAT_A2_DATA3_Msk) >> CAN_IF_DAT_A2_DATA3_Pos);
            pCanMsg->Data[4] = (uint8_t)(tCAN->IF[u32MsgIfNum].DAT_B1 & CAN_IF_DAT_B1_DATA4_Msk);
            pCanMsg->Data[5] = (uint8_t)((tCAN->IF[u32MsgIfNum].DAT_B1 & CAN_IF_DAT_B1_DATA5_Msk) >> CAN_IF_DAT_B1_DATA5_Pos);
            pCanMsg->Data[6] = (uint8_t)(tCAN->IF[u32MsgIfNum].DAT_B2 & CAN_IF_DAT_B2_DATA6_Msk);
            pCanMsg->Data[7] = (uint8_t)((tCAN->IF[u32MsgIfNum].DAT_B2 & CAN_IF_DAT_B2_DATA7_Msk) >> CAN_IF_DAT_B2_DATA7_Pos);

            ReleaseIF(tCAN, u32MsgIfNum);
        }
    }

    return rev;
}

static int can_update_spt(int sampl_pt, int tseg, int *tseg1, int *tseg2)
{
    *tseg2 = tseg + 1 - (sampl_pt * (tseg + 1)) / 1000;
    if (*tseg2 < ((int) TSEG2_MIN)) {
        *tseg2 = TSEG2_MIN;
    } else {
    }

    if (*tseg2 > ((int) TSEG2_MAX)) {
        *tseg2 = TSEG2_MAX;
    } else {
    }

    *tseg1 = tseg - *tseg2;
    if (*tseg1 > ((int) TSEG1_MAX)) {
        *tseg1 = TSEG1_MAX;
        *tseg2 = tseg - *tseg1;
    } else {
    }

    return 1000 * (tseg + 1 - *tseg2) / (tseg + 1);
}

/** @endcond HIDDEN_SYMBOLS */

/**
  * @brief Set bus baud-rate.
  *
  * @param[in] tCAN The pointer to CAN module base address.
  * @param[in] u32BaudRate The target CAN baud-rate. The range of u32BaudRate is 1~1000KHz.
  *
  * @return u32CurrentBitRate  Real baud-rate value.
  *
  * @details The function is used to set bus timing parameter according current clock and target baud-rate.
  */
uint32_t CAN_SetBaudRate(CAN_T *tCAN, uint32_t u32BaudRate)
{
    long rate;
    long best_error = 1000000000, error = 0;
    int best_tseg = 0, best_brp = 0, brp = 0;
    int tsegall, tseg = 0, tseg1 = 0, tseg2 = 0;
    int spt_error = 1000, spt = 0, sampl_pt;
    uint64_t clock_freq = (uint64_t)0, u64PCLK_DIV = (uint64_t)1;
    uint32_t sjw = (uint32_t)1;

    CAN_EnterInitMode(tCAN, (uint8_t)0);

    SystemCoreClockUpdate();
    if (tCAN == CAN0) {
        u64PCLK_DIV = (uint64_t)(CLK->PCLKDIV & CLK_PCLKDIV_APB0DIV_Msk);
        u64PCLK_DIV = (uint64_t)(1 << u64PCLK_DIV);
    } else if (tCAN == CAN1) {
        u64PCLK_DIV = (uint64_t)((CLK->PCLKDIV & CLK_PCLKDIV_APB1DIV_Msk) >> CLK_PCLKDIV_APB1DIV_Pos);
        u64PCLK_DIV = (uint64_t)(1 << u64PCLK_DIV);
    }

    clock_freq = SystemCoreClock / u64PCLK_DIV;

    if (u32BaudRate >= (uint32_t)1000000) {
        u32BaudRate = (uint32_t)1000000;
    }

    /* Use CIA recommended sample points */
    if (u32BaudRate > (uint32_t)800000) {
        sampl_pt = (int)750;
    } else if (u32BaudRate > (uint32_t)500000) {
        sampl_pt = (int)800;
    } else {
        sampl_pt = (int)875;
    }

    /* tseg even = round down, odd = round up */
    for (tseg = (TSEG1_MAX + TSEG2_MAX) * 2ul + 1ul; tseg >= (int)((TSEG1_MIN + TSEG2_MIN) * 2ul); tseg--) {
        tsegall = 1ul + tseg / 2ul;
        /* Compute all possible tseg choices (tseg=tseg1+tseg2) */
        brp = clock_freq / (tsegall * u32BaudRate) + tseg % 2;
        /* chose brp step which is possible in system */
        brp = (brp / BRP_INC) * BRP_INC;

        if ((brp < ((int) BRP_MIN)) || (brp > ((int) BRP_MAX))) {
            continue;
        }
        rate = clock_freq / (brp * tsegall);

        error = u32BaudRate - rate;

        /* tseg brp biterror */
        if (error < 0) {
            error = -error;
        }
        if (error > best_error) {
            continue;
        }
        best_error = error;
        if (error == 0) {
            spt = can_update_spt(sampl_pt, tseg / 2, &tseg1, &tseg2);
            error = sampl_pt - spt;
            if (error < 0) {
                error = -error;
            }
            if (error > spt_error) {
                continue;
            }
            spt_error = error;
        }
        best_tseg = tseg / 2;
        best_brp = brp;

