ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M480/device/StdDriver/m480_can.c
        while (CAN_SetRxMsgObj(tCAN, (uint8_t)u32MsgNum, (uint8_t)u32IDType, u32ID, (uint8_t)u32EOB_Flag) == (int32_t)FALSE) {
            if (++u32TimeOutCount >= RETRY_COUNTS) {
                rev = (int32_t)FALSE;
                break;
            } else {
            }
        }
    }

    return rev;
}


/**
  * @brief Send CAN message.
  * @param[in] tCAN The pointer to CAN module base address.
  * @param[in] u32MsgNum Specifies the Message object number, from 0 to 31.
  * @param[in] pCanMsg Pointer to the message structure where received data is copied.
  *
  * @retval FALSE 1. When operation in basic mode: Transmit message time out. \n
  *               2. When operation in normal mode: No useful interface. \n
  * @retval TRUE Transmit Message success.
  *
  * @details The receive/transmit priority for the Message Objects is attached to the message number.
  *          Message Object 1 has the highest priority, while Message Object 32 has the lowest priority.
  */
int32_t CAN_Transmit(CAN_T *tCAN, uint32_t u32MsgNum, STR_CANMSG_T *pCanMsg)
{
    int32_t rev = (int32_t)TRUE;
    uint32_t u32Tmp;

    u32Tmp = (tCAN->TEST & CAN_TEST_BASIC_Msk);

    if ((tCAN->CON & CAN_CON_TEST_Msk) && u32Tmp) {
        rev = CAN_BasicSendMsg(tCAN, pCanMsg);
    } else {
        if (CAN_SetTxMsg(tCAN, u32MsgNum, pCanMsg) == FALSE) {
            rev = (int32_t)FALSE;
        } else {
            CAN_TriggerTxMsg(tCAN, u32MsgNum);
        }
    }

    return rev;
}


/**
  * @brief Gets the message, if received.
  * @param[in] tCAN The pointer to CAN module base address.
  * @param[in] u32MsgNum Specifies the Message object number, from 0 to 31.
  * @param[in] pCanMsg Pointer to the message structure where received data is copied.
  *
  * @retval FALSE No any message received.
  * @retval TRUE Receive Message success.
  *
  * @details The Interface Registers avoid conflict between the CPU accesses to the Message RAM and CAN message reception
  *          and transmission by buffering the data to be transferred.
  */
int32_t CAN_Receive(CAN_T *tCAN, uint32_t u32MsgNum, STR_CANMSG_T *pCanMsg)
{
    int32_t rev = (int32_t)TRUE;
    uint32_t u32Tmp;

    u32Tmp = (tCAN->TEST & CAN_TEST_BASIC_Msk);

    if ((tCAN->CON & CAN_CON_TEST_Msk) && u32Tmp) {
        rev = CAN_BasicReceiveMsg(tCAN, pCanMsg);
    } else {
        rev = CAN_ReadMsgObj(tCAN, (uint8_t)u32MsgNum, (uint8_t)TRUE, pCanMsg);
    }

    return rev;
}

/**
  * @brief Clear interrupt pending bit.
  * @param[in] tCAN The pointer to CAN module base address.
  * @param[in] u32MsgNum Specifies the Message object number, from 0 to 31.
  *
  * @return None
  *
  * @details An interrupt remains pending until the application software has cleared it.
  */
void CAN_CLR_INT_PENDING_BIT(CAN_T *tCAN, uint8_t u32MsgNum)
{
    uint32_t u32MsgIfNum;

    if ((u32MsgIfNum = LockIF_TL(tCAN)) == 2ul) {
        u32MsgIfNum = 0ul;
    } else {
    }

    tCAN->IF[u32MsgIfNum].CMASK = CAN_IF_CMASK_CLRINTPND_Msk | CAN_IF_CMASK_TXRQSTNEWDAT_Msk;
    tCAN->IF[u32MsgIfNum].CREQ = 1ul + u32MsgNum;

    ReleaseIF(tCAN, u32MsgIfNum);
}


/*@}*/ /* end of group M480_CAN_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group M480_CAN_Driver */

/*@}*/ /* end of group M480_Device_Driver */

/*** (C) COPYRIGHT 2016 Nuvoton Technology Corp. ***/

